{"posts":[{"title":"从另一角度看 为什么中国不应该有GFW","text":"相信反贼肯定都对GFW深恶痛绝，中国是为数不多使用局域网限制民众的国家之一。GFW限制人民自由，阻碍网民上网，这是中国不应该有GFW的最大理由。 然而本篇并不想无意义的强调一遍这个人人皆知的知识，而是从另一角度看中国为什么不应该又GFW，那就是粉红经常洗白的话术： “西方媒体这么黑中国，所以要建墙屏蔽。” 首先，中共的封锁和西方的谴责是相辅相成的，中共越封锁，西方越谴责，中共接着加高墙壁。中共的封锁也不止体现在网络上，在还没有网络的几十年前，中共就已经限制人民集会，游行，示威，办报等的自由。至于是先封锁还是先谴责，我也不得而知，况且这两者也是主观的，可以慢慢形成氛围，即使是询问年龄较大的长者，恐怕他们也得不出真相。 其次，众人皆知，中共建墙是维护国家利益，但是损害了人民利益。国家应该和大多数人站在一起，而不是背道而驰。 举一个不知恰不恰当的例子，一个匪徒持刀抢劫，被抓后声称自己是为了赚钱。事实上谁都知道他抢劫是为了赚钱，但是抢劫的行为损害了大多数人的利益，因此劫匪必须被绳之以法。","link":"/2022/11/21/%E4%BB%8E%E5%8F%A6%E4%B8%80%E8%A7%92%E5%BA%A6%E7%9C%8B%20%E4%B8%BA%E4%BB%80%E4%B9%88%E4%B8%AD%E5%9B%BD%E4%B8%8D%E5%BA%94%E8%AF%A5%E6%9C%89GFW/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2022/11/21/hello-world/"},{"title":"建站心得","text":"耗时一整天，调试了几个小时，我终于摸清了建站的门路，用hexo+github静态托管的方式建好了我的 第一个博客 ，期间也遇到了很多的问题，最终都得以解决，收获良多 1、善用搜索引擎遇到问题报错代码，可以先粗看一下，看不懂的话就拖搜索引擎里。Google搜索较为专业，搜索到的大多都是github的issue或者StackOverflow等社区的问答，优点是较为全面，缺点是大多是英文。百度搜索里大多是CSDN等，优点是中文容易看懂，缺点是CSDN过于恶心，不登陆不给复制代码，有些作者不关注还不让看文章。 2、确保所有软件都是最新版我在使用npm install的时候报错，经过上网搜索发现是node.js版本过于老旧，更新后解决完毕。 3、github主题凭借着以前使用github的经验，我新建了一个库，添加了一个readme文件后准备选定主题，这时我发现主题选择器不见了。我翻阅建站教程，他们的教程里却能照常使用主题选择器。通过搜索引擎，我发现了9月23日github社区的一个帖子，一个用户发现了主题选择器不见了，在社区里询问后得到了官方人员的回复。点进回复里的网址，我发现github在9月22日取消了主题选择器。而网上的教程几乎全部遭早于改动前，因此必须在库里新建_config.yml后写入Theme:XXX，才能顺利选择主题。 4、github分支网上的教程说要往.config.yml尾部加入deploy:branch:master，而github却没有默认branch，需要设置，必须在pages里把source从github actions调到deploy from a branch，然后在branches里把默认branches从main改为master 5、GFW的阻挠我在进行hexo的部署时输入hexo d，却报错了，上网搜索后发现很多人都如此，错误代码也大同小异，基本如下 123456err: Error: Spawn failed at ChildProcess.&lt;anonymous&gt; (C:\\CODE\\blog\\node_modules\\hexo-deployer-git\\node_modules\\hexo-util\\lib\\spawn.js:51:21) at ChildProcess.emit (events.js:315:20) at ChildProcess.cp.emit (C:\\CODE\\blog\\node_modules\\cross-spawn\\lib\\enoent.js:34:29) at Process.ChildProcess._handle.onexit (internal/child_process.js:275:12) { code: 128 在github社区的一个英文回复中，一个人说链接手机热点可以解决该问题，在尝试其它方法未果后我试了一下，居然成功了。我又试了好多遍，发现这个方法虽然可行，但是成功率很低，好几次提交只有一次能成功，不过已经比之前的好很多了，极大的鼓舞了我。在上网搜索中，我得知可以把.config.yml尾部的deploy-repo后的链接从HTTPS形式改成SSH形式，我试了一下，果然完全成功了 经过查阅，发现这种情况可能是因为移动宽带的问题，令人感叹，GFW真是害人不浅，单单用VPN还没用。","link":"/2022/11/16/%E5%BB%BA%E7%AB%99%E5%BF%83%E5%BE%97/"},{"title":"简评敖厂长","text":"敖厂长是一个很有名的游戏UP主，几年前很火。 今天他为了恰一个国内壁纸软件的饭，强烈批评steam上的壁纸引擎，说里面有大量R18内容，危害审核，让大家少用，把B站不会翻墙的人气死了，我不会翻墙，要是铁拳砸下来把壁纸引擎墙了，我怎么导管子？ 然后自然是一通臭骂，敖厂长灰溜溜地删了视频，愤怒的网友冲到他的上一个视频里继续骂，然后敖厂长开启了控评，所有评论全部被替换为“好好好”，最后开启阿瓦隆，发出去的评论你看得到别人看不到，你看到的别人的最新评论已经是一小时前的了。 网友还不罢休，把敖厂长的视频上传到了壁纸引擎上，颇为好笑的是他们偏偏传到了R18分区。数个补档视频马上冲到了壁纸引擎的热榜榜首，可以说是非常壮观了 网民这次是怕被铁拳砸，然后痛骂引来铁拳的人，所有人都知道砸他的是铁拳，但是对铁拳噤若寒蝉，什么时候他们能真正关注到铁拳呢，可能大部分人一辈子也不能吧","link":"/2022/11/26/%E7%AE%80%E8%AF%84%E6%95%96%E5%8E%82%E9%95%BF/"},{"title":"学生健身指南","text":"免责声明本文部分引用于澳洲政府网站，仅作建议，不对其负责，要是把身体搞坏了，就算找澳洲政府也别来找我 前言小黄人本身食谱就缺少肉蛋奶，整天碳水嗯造，更不用提学生一日三餐说不定都不能保证，就导致营养跟不上，即使健身了，不补充营养也是比黑哥白男落下许多，要改善这些赶超洋大人，好的补剂很重要，但是学生也必须控制预算 蛋白质蛋白质是组成肌肉的重要部分 大强度训练中的运动员的蛋白质目标是每天每公斤体重1.2-1.6克，这是对久坐人群推荐量的两倍。 如果你体重70kg，那你就需要80-120左右克的蛋白质，日常饮食基本离这差很多，除非你顿顿吃肉。要补充蛋白质，有两种好方法：1、吃鸡肉100g即食鸡腿，含有30g蛋白质，很不错，价格3-4元/个，缺点是有添加剂，可能高盐高糖鸡胸肉同理，不过我没吃过，不评价2、蛋白粉蛋白粉价格通常一磅450g要50-60元，不同牌子剂量不一样，有些每天25g，有些每天30g，算下来一天3-5块左右。值得一提的是蛋白粉不全是蛋白，只有百分之七八十是蛋白，其他的是BCAA或者glutamine，帮助健身恢复，防止肌肉流失。蛋白粉的味道要看厂家的造诣，总的来说就是不坏，风味饮料水平。这就不得不提我几年前不懂事买了桶汤臣倍健的大豆蛋白，本来是给中老年人保健的，贼难吃，我不知道是植物蛋白都难吃还是就他的难吃，反正千万不要买。蛋白粉这种考验生产力的，离中国牌子还是远点好。 维生素维生素是现代科技的结晶，如果一个现代人带着维生素穿越回古代，一定会被尊为神医。大部分维生素不用买那种精装的，买药店那种小瓶的小片药，两三块一百片，能吃三个月了，剂量还比精装的高。维C和B族是水溶性的，只要不吃太多，都可以通过尿液代谢出来，所以不用担心过量了会怎么样，只要不往死里吃都没问题。维生素D和钙片小瓶药有点难找，我就买的精装得了，九块九六十片，也够了。如果你平时喝牛奶的话甚至不用补钙了，不过牛奶也不便宜，一瓶也要两三块了。 咖啡因","link":"/2022/11/27/%E5%AD%A6%E7%94%9F%E5%81%A5%E8%BA%AB%E6%8C%87%E5%8D%97/"},{"title":"观上海抗议有感","text":"为了纪念乌鲁木齐火灾，上海市民在乌鲁木齐路聚集抗议，大喊共产党下台，习近平下台，场所码操你妈之类的口号。这是我人生中第一次看到这么多人齐声抗议，还是在我最看不起的中国人身上，即使在党国的枪炮面前一切都是螳臂当车，哪怕坦克粉碎一切，也粉碎不了真相，我永远铭记彭载舟和全国各地的义士。但愿抗议的都是独立思考不是气氛起来顺便喊两句，如果真的人人这样的话好日子就不远了。","link":"/2022/11/27/%E8%A7%82%E4%B8%8A%E6%B5%B7%E6%8A%97%E8%AE%AE%E6%9C%89%E6%84%9F/"},{"title":"纪念江泽民","text":"新闻发布几分钟内，别人就告诉我了江泽民的死讯。我的内心很平静，没有悲痛也没有挽留。原因很简单，他的黑点太多了。镇压学潮，计划生育，贪污腐败，还有轮子的种种指控。但即使抛开这些不谈，江泽民也和我不是同一路人。他是共产党的人，我反共，他死了我不可能沉痛悼念，也不会有丝毫怜悯之情。但由于我的过去，我不会骂他，也不会开香槟，写文纪念他，不是因为我敬重他，而是我想纪念我的过去。 我最早接触江泽民是在一个信息技术论坛里，当时我还不会翻墙，看其他人念诗接龙，也不知怎么就知道了膜蛤。如果放在现在的高压言论管制下，简直不可能。然后我看了他的传记，在kindle上看的，但是当时不知道8964之类的事情，对政治也不感冒，看的云里雾里的。 后来我学会了翻墙，知道了64学潮，也找到了新蛤社之类的膜蛤鬼畜，又看了一边他的传记，变成了蛤丝。但是我当时还算不上反华反共，看到乳包内容，包括在某维基（那时候还活着）看到包子的个人信息，都不点进去迅速离开，以免被警察找上。不得不说中共的审查真的是害人不浅，刚翻墙的时候就算是法外之地我也格外神经质，当然现在肆无忌惮点了。 我刚翻墙的时候曾经在youtube上看到有人怒斥小留，谴责人家在国外呆那么久还认不清中共。当时的我虽然对中共也有不满但还坚信本意是好的下面执行歪了，反对台独港独，可以算是半个粉红，看到这话不怎么认同，但是随着我外网冲浪时间渐渐变多，以及包子的铁拳下，我的立场也开始转变，我也开始认同这句话。习胡江邓毛在我心中也不再神圣，尤其是毛。在国内左人的影响下我甚至有段时间准备读资本论 毛选之类的左人最爱的文献，如今看来真是幸运我没有碰这些恶心的东西，不是同一路人。不过膜蛤乳包鬼畜我还是有看，听说膜蛤本来就是嘲讽江泽民的，后来演变成膜拜他，看来到了境外还是本意是好的最后变坏了。 我对轮子的印象也有所改观，之前我认为轮子是十恶不赦的邪教，如今我不再看不起轮子，甚至将其视为可以信任的对象。如果连轮子的自由门都不信任，还有哪个梯子能信任？但是轮子也有许多缺点，主观来看，宣传海报，新闻排版的审美老土，客观来看，新闻也有时像中共一样只摘录对自己有利的，不摘录对自己有害的，比如佩罗西访问台湾时，中国媒体搬运境外评论清一色的支持自己的，这次江泽民去世，轮子的评论也清一色地搬运骂江泽民的。据说轮子的部分新闻真实性也有待商榷，但是我对其没有研究过也是道听途说，我也暂时没有兴趣研究。 结合当下的时事背景，江泽民的去世给示威游行的人提供了一个新的理由，这是极好的。江泽民派系也算是和习近平派系对立，我很期望能够看到江派的人能够制衡习派，也很希望能有更多人上街游行。 江泽民活了96岁，也留下了许多金句，在蛤丝和反贼中都有流传，我在日常中也有引用他的语录，相比包子的语录，哪怕被晶哥发现了，膜蛤相对乳包也没那么容易引言获罪。他的评价在墙外相对包子清一色的反对来说要复杂一点。谨以此文纪念膜蛤文化和我的过去。","link":"/2022/11/30/%E7%BA%AA%E5%BF%B5%E6%B1%9F%E6%B3%BD%E6%B0%91/"},{"title":"这两天的事情让我想起了1984","text":"我非常推荐反贼都看看1984，我严重怀疑党员看的不是习近平治国理政是这本书。看这本书会有一种看墙内反贼触摸的感觉，很乐 1984中，主角所在的国家以外部战争掩盖内部矛盾，生产多余的枪炮弹药以消耗多余的生产力，但是政府很脑瘫，把人民当狗耍，不停篡改新闻，今天和这个国家打仗，明天交战的就是另一个国家了，和之前的国家还是和平状态。民众也是sb，不知是信以为真还是习惯了，也不敢反抗，反抗了就被晶哥抓走。 这两天也一样，前两天还是奥米克戎后遗症巨大，大修方舱，坚持清零一百年不动摇，今天就大刹车，暂无证据证明后遗症， 然后直接放开，再买几个“93岁老人感染后称新冠没那么可怕”，“专家称90%的人会感染”，“你准备好被感染了吗”，“张文宏称99%的人不用去医院”之类的弱智热搜，然后粉红在下面坚决拥护，说什么国家保护了我们三年，这事也就这么过去了 有没有觉得很相似？","link":"/2022/12/09/%E8%BF%99%E4%B8%A4%E5%A4%A9%E7%9A%84%E4%BA%8B%E6%83%85%E8%AE%A9%E6%88%91%E6%83%B3%E8%B5%B7%E4%BA%861984/"}],"tags":[{"name":"政治 中共","slug":"政治-中共","link":"/tags/%E6%94%BF%E6%B2%BB-%E4%B8%AD%E5%85%B1/"},{"name":"计算机","slug":"计算机","link":"/tags/%E8%AE%A1%E7%AE%97%E6%9C%BA/"},{"name":"健身","slug":"健身","link":"/tags/%E5%81%A5%E8%BA%AB/"},{"name":"中共","slug":"中共","link":"/tags/%E4%B8%AD%E5%85%B1/"}],"categories":[{"name":"指点江山","slug":"指点江山","link":"/categories/%E6%8C%87%E7%82%B9%E6%B1%9F%E5%B1%B1/"},{"name":"经验分享","slug":"经验分享","link":"/categories/%E7%BB%8F%E9%AA%8C%E5%88%86%E4%BA%AB/"},{"name":"随笔","slug":"随笔","link":"/categories/%E9%9A%8F%E7%AC%94/"},{"name":"长文","slug":"长文","link":"/categories/%E9%95%BF%E6%96%87/"},{"name":"知识分享","slug":"经验分享/知识分享","link":"/categories/%E7%BB%8F%E9%AA%8C%E5%88%86%E4%BA%AB/%E7%9F%A5%E8%AF%86%E5%88%86%E4%BA%AB/"}],"pages":[]}